src/cfe/package-manager/InformationRegisters/пм_УстановленныеПакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>пм_УстановленныеПакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаяВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пм_ИсточникиПакетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пм_ИсточникиПакетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пм_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/package-manager/CommonModules/пм_ПроверкаОбновлений/Ext/Module.bsl
#Если Сервер Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обработчик регламентного задания пм_ПроверкаОбновленийПакетов.
//
// Задание только отмечает наличие более новых версий: ничего не скачивает
// и не устанавливает. Расписание по умолчанию выключено, включать его
// должен администратор осознанно.
//
Процедура ВыполнитьПроверкуПоРасписанию() Экспорт

	ОбщегоНазначенияЗарегистрироватьВыполнение();

	Результат = ПроверитьОбновления();

	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурнала(),
		УровеньЖурналаРегистрации.Информация,
		,
		,
		СтрШаблон(
			НСтр("ru = 'Проверено пакетов: %1. Доступно обновлений: %2. Источников с ошибкой: %3.'"),
			Результат.ПровереноПакетов,
			Результат.ДоступноОбновлений,
			Результат.ИсточниковСОшибкой));

КонецПроцедуры

// Проверяет наличие более новых версий для всех установленных пакетов.
//
// Параметры:
//  ИсточникПакетов - СправочникСсылка.пм_ИсточникиПакетов - Проверить только
//                    этот источник. Если не указан, проверяются все.
//
// Возвращаемое значение:
//  Структура - Итоги проверки:
// * ПровереноПакетов - Число
// * ДоступноОбновлений - Число
// * ИсточниковСОшибкой - Число
//
Функция ПроверитьОбновления(ИсточникПакетов = Неопределено) Экспорт

	Итоги = Новый Структура;
	Итоги.Вставить("ПровереноПакетов", 0);
	Итоги.Вставить("ДоступноОбновлений", 0);
	Итоги.Вставить("ИсточниковСОшибкой", 0);

	УстановитьПривилегированныйРежим(Истина);

	Сведения = РегистрыСведений.пм_УстановленныеПакеты.ВерсииПакетов(, ИсточникПакетов);

	// Пакеты сгруппированы по источникам: провайдер и идентификатор проекта
	// определяются один раз на источник, а не на каждый пакет.
	ПоИсточникам = Новый Соответствие;
	Для Каждого Строка Из Сведения Цикл
		Если Не ЗначениеЗаполнено(Строка.Источник) Или Не ЗначениеЗаполнено(Строка.Пакет) Тогда
			Продолжить;
		КонецЕсли;
		Если ПоИсточникам.Получить(Строка.Источник) = Неопределено Тогда
			ПоИсточникам.Вставить(Строка.Источник, Новый Массив);
		КонецЕсли;
		ПоИсточникам.Получить(Строка.Источник).Добавить(Строка);
	КонецЦикла;

	Для Каждого ЭлементСоответствия Из ПоИсточникам Цикл

		Попытка
			ПроверитьИсточник(ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение, Итоги);
			Справочники.пм_ИсточникиПакетов.ЗапомнитьОшибку(ЭлементСоответствия.Ключ, "");
		Исключение
			Итоги.ИсточниковСОшибкой = Итоги.ИсточниковСОшибкой + 1;
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Справочники.пм_ИсточникиПакетов.ЗапомнитьОшибку(ЭлементСоответствия.Ключ, ТекстОшибки);
			ЗаписьЖурналаРегистрации(
				ИмяСобытияЖурнала(),
				УровеньЖурналаРегистрации.Ошибка,
				, ЭлементСоответствия.Ключ, ТекстОшибки);
		КонецПопытки;

	КонецЦикла;

	Возврат Итоги;

КонецФункции

Функция ИмяСобытияЖурнала() Экспорт

	Возврат НСтр("ru = 'Менеджер пакетов.Проверка обновлений'");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьИсточник(ИсточникСсылка, СтрокиПакетов, Итоги)

	Источник = Справочники.пм_ИсточникиПакетов.ОписаниеИсточника(ИсточникСсылка);

	Если Не пм_ПровайдерыПакетов.ПровайдерРеализован(Источник.Провайдер) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Провайдер %1 пока не реализован.'"), Источник.Провайдер);
	КонецЕсли;

	Провайдер = пм_ПровайдерыПакетов.МодульПровайдера(Источник.Провайдер);

	Для Каждого СтрокаПакета Из СтрокиПакетов Цикл

		Итоги.ПровереноПакетов = Итоги.ПровереноПакетов + 1;

		Версии = Провайдер.ПолучитьВерсииПакета(Источник, СтрокаПакета.Пакет, "", 0);
		ДоступнаяВерсия = НаиболееНоваяВерсия(Версии);

		ЕстьОбновление = ЗначениеЗаполнено(ДоступнаяВерсия)
			И ЗначениеЗаполнено(СтрокаПакета.Версия)
			И пм_ВерсииПакетов.СравнитьВерсии(ДоступнаяВерсия, СтрокаПакета.Версия) > 0;

		Если ЕстьОбновление Тогда
			Итоги.ДоступноОбновлений = Итоги.ДоступноОбновлений + 1;
		КонецЕсли;

		ЗаписатьРезультатПроверки(СтрокаПакета, ДоступнаяВерсия);

	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьРезультатПроверки(СтрокаПакета, ДоступнаяВерсия)

	Сведения = РегистрыСведений.пм_УстановленныеПакеты.СтруктураЗаписи();
	ЗаполнитьЗначенияСвойств(Сведения, СтрокаПакета);
	Сведения.ДоступнаяВерсия = ДоступнаяВерсия;
	Сведения.ДатаПроверки = ТекущаяДатаСеанса();

	РегистрыСведений.пм_УстановленныеПакеты.ОбновитьСведения(Сведения);

КонецПроцедуры

Функция НаиболееНоваяВерсия(Версии)

	Наибольшая = "";

	Для Каждого Версия Из Версии Цикл
		Номер = Версия.Получить("version");
		Если Не ЗначениеЗаполнено(Наибольшая)
			Или пм_ВерсииПакетов.СравнитьВерсии(Номер, Наибольшая) > 0 Тогда
			Наибольшая = Номер;
		КонецЕсли;
	КонецЦикла;

	Возврат Наибольшая;

КонецФункции

// Регламентное задание расширения выполняется в контексте всех активных
// расширений. Отдельной регистрации БСП здесь не требуется, но если
// подсистема регламентных заданий доступна, отметимся в ней.
Процедура ОбщегоНазначенияЗарегистрироватьВыполнение()

	Если Метаданные.ОбщиеМодули.Найти("РегламентныеЗаданияСервер") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Модуль = пм_ОбщегоНазначения.ОбщийМодуль("РегламентныеЗаданияСервер");
	Если Модуль = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Модуль.ПриНачалеВыполненияРегламентногоЗадания();
	Исключение
		// Сигнатура метода в разных версиях БСП отличается: если вызвать
		// не удалось, проверку это не блокирует.
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурнала(),
			УровеньЖурналаРегистрации.Предупреждение,
			, , ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
